In [55]:
import pandas as pd
import numpy as np

In [2]:
url = 'http://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'

# seperate = 크기에 상관 없이 모든 빈공간
# url에 header는 포함되어있지 않다
df = pd.read_csv(url, sep='\s+', header=None)

# 처음 다섯개 출력 (기본값 n=5)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [5]:
# columns를 할당 가능
df.columns = []

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], dtype='int64')

### series

In [8]:
l = [1, 2, 3, 4, 5]
# index를 직접 지정 가능
obj = pd.Series(data = l, index = ['a', 'b', 'c', 'd', 'e'])
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
# dict로 index : data 한꺼번에 설정
dict_data = {'a':1, 'b':2, 'c':3}
obj2 = pd.Series(dict_data, name='ex')
obj2

a    1
b    2
c    3
Name: ex, dtype: int64

In [11]:
obj2.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
obj2.values

array([1, 2, 3], dtype=int64)

In [14]:
type(obj2.values)

numpy.ndarray

### data frame

In [56]:
raw_data = {'first name': ['jason', 'molly', 'tina', 'jake', 'amy'],
           'age': [33, 41, 23, 42, 55],
           'country': ['USA', 'korea', 'japan', 'china', 'italy']}

In [57]:
df = pd.DataFrame(raw_data)
df

  first name  age country
0      jason   33     USA
1      molly   41   korea
2       tina   23   japan
3       jake   42   china
4        amy   55   italy

In [67]:
# 일부 column만 지정 가능
df = pd.DataFrame(raw_data, columns = ['first name', 'age'])
df

  first name  age
0      jason   33
1      molly   41
2       tina   23
3       jake   42
4        amy   55

In [59]:
# 접근 방식1
df.age

0    33
1    41
2    23
3    42
4    55
Name: age, dtype: int64

In [60]:
# 접근 방식2
df['first name']

0    jason
1    molly
2     tina
3     jake
4      amy
Name: first name, dtype: object

In [61]:
type(df.age)  # series 타입

pandas.core.series.Series

In [62]:
# indexing
s = pd.Series(np.nan, index=[10, 11, 12, 1, 2, 3, 4, 5])

# 처음부터 지정된 인덱스 3번까지
print(s.loc[:3])

# 처음부터 3개 (순서대로의 숫자로 치환된 인덱스)
print(s.iloc[:3])

10   NaN
11   NaN
12   NaN
1    NaN
2    NaN
3    NaN
dtype: float64
10   NaN
11   NaN
12   NaN
dtype: float64

In [63]:
# 새로운 데이터 할당
df.age > 40

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [70]:
df.debt = df.age > 40
df.debt

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [72]:
df.temp = pd.Series([0, 0, 1, 1, 1])
df.temp

0    0
1    0
2    1
3    1
4    1
dtype: int64

In [68]:
# json 데이터
json_data = {'a': {2001: 1.0, 2002: 1.5}, 'b': {2000: 1.4, 2001: 1.2}}

pd.DataFrame(json_data)

        a    b
2001  1.0  1.2
2002  1.5  NaN
2000  NaN  1.4